package absoft;
/*
Написать программу которая будет выводить цифры от 1 до 5 используя цикл for
 */

public class test6_for {
    public static void main(String[] args) {

        for (int i = 0; i < 5; i++)
        System.out.println(i + 1 + " ");
    }

}
